##ДЗ 4.1. Перемістити всі нулі до кінця списку
#[0, 1, 0, 12, 3] -> [1, 12, 3, 0, 0]
#[0] -> [0]
#[1, 0, 13, 0, 0, 0, 5] -> [1, 13, 5, 0, 0, 0, 0]
#[9, 0, 7, 31, 0, 45, 0, 45, 0, 45, 0, 0, 96, 0] -> [9, 7, 31, 45, 45, 45, 96, 0, 0, 0, 0, 0, 0, 0]
#lst=[0]
lst = [9, 0, 7, 31, 0, 45, 0, 45, 0, 45, 0, 0, 96, 0]
print(lst,"->",end='') #вивід початкового списку
i=0 #змінна ітерацій першого while
ii=0 #змінна ітерацій другого while
nzero=lst.count(0) #підрахунок кількості 0 у списку
lzero=[] #список порожній список
while ii<nzero: #ітерації від 0 до числа кількості нулів у списку
   lzero.append(0) #наповнюємо порожній список потрібною кількістю нулів
   ii+=1
while i<nzero: #ітерації від 0 до числа кількості нулів у списку
   lst.remove(0) #видаляємо нулі з початкового списку
   i+=1
lst=lst+lzero #до списку без нулів додаємо список з нулями
print(lst)
